
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаНапиткаСоставЧека.Номенклатура КАК Номенклатура,
		|	СУММА(ПродажаНапиткаСоставЧека.Количество) КАК Количество,
		|	ПродажаНапиткаСоставЧека.Ссылка.ТорговаяТочка КАК ТорговаяТочка
		|ПОМЕСТИТЬ втТЧТовары
		|ИЗ
		|	Документ.ПродажаНапитка.СоставЧека КАК ПродажаНапиткаСоставЧека
		|ГДЕ
		|	ПродажаНапиткаСоставЧека.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаНапиткаСоставЧека.Номенклатура,
		|	ПродажаНапиткаСоставЧека.Ссылка.ТорговаяТочка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЧТовары.Номенклатура КАК Номенклатура,
		|	втТЧТовары.Количество КАК Количество,
		|	втТЧТовары.Количество - ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК Нехватка,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	втТЧТовары КАК втТЧТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(&Дата, ) КАК ОстаткиТоваровОстатки
		|		ПО втТЧТовары.Номенклатура = ОстаткиТоваровОстатки.Номенклатура
		|			И втТЧТовары.ТорговаяТочка = ОстаткиТоваровОстатки.ТорговаяТочка
		|ГДЕ
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) <= втТЧТовары.Количество";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() <> 0 Тогда
		
		Отказ = Истина;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ТекстСообщения = СтрШаблон("Товара %1 не хватает в количестве %2");
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	Движения.ПродажиКофеен.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаНапиткаСоставЧека.Номенклатура КАК Номенклатура,
		|	СУММА(ПродажаНапиткаСоставЧека.Количество) КАК Количество
		|ИЗ
		|	Документ.ПродажаНапитка.СоставЧека КАК ПродажаНапиткаСоставЧека
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаНапиткаСоставЧека.Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		// регистр ПродажиКофеен 
		Движение = Движения.ПродажиКофеен.Добавить();
		Движение.Период = Дата;
		Движение.ТорговаяТочка = ТорговаяТочка;
		Движение.Сотрудник = Сотрудник;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.МетодОплаты = МетодОплаты;
		Движение.ДатаПродажи = Дата;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Сумма = Сумма;
		
		// регистр ОстаткиИнгредиентов Расход
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ТорговаяТочка = ТорговаяТочка;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		
	КонецЦикла;
	
КонецПроцедуры
