&НаСервере
Функция СоставЧекаНоменклатураПриИзмененииНаСервере(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КофеИНапитки.ЦенаПродажи КАК ЦенаПродажи
		|ИЗ
		|	Справочник.КофеИНапитки КАК КофеИНапитки
		|ГДЕ
		|	КофеИНапитки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ЦенаПродажи;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура СоставЧекаНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СоставЧека.ТекущиеДанные;
	
	ТекущаяСтрока.СтавкаНДС = 22;
	
	ТекущаяСтрока.Цена = СоставЧекаНоменклатураПриИзмененииНаСервере(ТекущаяСтрока.Номенклатура);
	СтавкаНДС = ТекущаяСтрока.Цена / (100 + ТекущаяСтрока.СтавкаНДС) * ТекущаяСтрока.СтавкаНДС;
	ТекущаяСтрока.Цена = ТекущаяСтрока.Цена + СтавкаНДС;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставЧекаКоличествоПриИзменении(Элемент)
		ТекущаяСтрока = Элементы.СоставЧека.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	
	Объект.Сумма =  Объект.СоставЧека.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура СоставЧекаЦенаПриИзменении(Элемент)
		ТекущаяСтрока = Элементы.СоставЧека.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	
	Объект.Сумма =  Объект.СоставЧека.Итог("Сумма");

КонецПроцедуры
